# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [66]:
import pandas as pd
import numpy as np

### Step 2. Create the DataFrame with the following values:

In [67]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [68]:
regiment = pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [24]:
regiment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   regiment       12 non-null     object
 1   company        12 non-null     object
 2   name           12 non-null     object
 3   preTestScore   12 non-null     int64
 4   postTestScore  12 non-null     int64
dtypes: int64(2), object(3)
memory usage: 608.0+ bytes

In [33]:
regiment.describe()

       preTestScore  postTestScore
count     12.000000      12.000000
mean      11.083333      62.333333
std       12.324833      21.376850
min        2.000000      25.000000
25%        2.750000      57.000000
50%        3.500000      62.000000
75%       24.000000      70.000000
max       31.000000      94.000000

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [21]:
reg_prts = regiment.groupby(regiment['regiment']).agg({'preTestScore': np.mean})[1:2]
reg_prts

            preTestScore
regiment
Nighthawks         15.25

In [22]:
reg_prts = regiment.groupby(regiment['regiment']).mean()[1:2]
reg_prts

            preTestScore  postTestScore
regiment
Nighthawks         15.25           59.5

### Step 5. Present general statistics by company

In [72]:
#general stats
min= regiment['company'].min()
print(min)
max = regiment['company'].max()
print(max)
count = regiment['company'].count()
print(count)

1st
2nd
12

In [32]:
gstat_com = regiment.groupby(['regiment','company']).sum()
gstat_com

                    preTestScore  postTestScore
regiment   company
Dragoons   1st                 7             95
           2nd                55            151
Nighthawks 1st                28            119
           2nd                33            119
Scouts     1st                 5            132
           2nd                 5            132

In [62]:
gst = regiment['company'].describe()
gst

count      12
unique      2
top       2nd
freq        6
Name: company, dtype: object

In [41]:
gstat = pd.pivot_table(regiment, index = ['regiment','company'], values = ['preTestScore', 'postTestScore'], aggfunc = np.sum)
gstat

                    postTestScore  preTestScore
regiment   company
Dragoons   1st                 95             7
           2nd                151            55
Nighthawks 1st                119            28
           2nd                119            33
Scouts     1st                132             5
           2nd                132             5

### Step 6. What is the mean each company's preTestScore?

In [47]:
mean = regiment.groupby('company').agg({'preTestScore':np.mean})
mean

         preTestScore
company
1st          6.666667
2nd         15.500000

### Step 7. Present the mean preTestScores grouped by regiment and company

In [49]:
meanrc = regiment.groupby(['regiment','company']).agg({'preTestScore':np.mean})
meanrc

                    preTestScore
regiment   company
Dragoons   1st               3.5
           2nd              27.5
Nighthawks 1st              14.0
           2nd              16.5
Scouts     1st               2.5
           2nd               2.5

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [52]:
meanrc = regiment.groupby(['regiment','company']).agg({'preTestScore':np.mean})
meanrc.reset_index()

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

### Step 9. Group the entire dataframe by regiment and company

In [59]:
meanrc = regiment.groupby(['regiment','company']).mean()
meanrc

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

### Step 10. What is the number of observations in each regiment and company

In [63]:
# num of observations
meanrc = regiment.groupby(['regiment','company']).size()
meanrc

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [60]:
meanrc = regiment.groupby(['regiment','company','name']).mean()
meanrc

                             preTestScore  postTestScore
regiment   company name
Dragoons   1st     Cooze                3             70
                   Jacon                4             25
           2nd     Ryaner              24             94
                   Sone                31             57
Nighthawks 1st     Jacobson            24             94
                   Miller               4             25
           2nd     Ali                 31             57
                   Milner               2             62
Scouts     1st     Piger                3             70
                   Sloan                2             62
           2nd     Ali                  3             70
                   Riani                2             62

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [74]:
for regiment,group in regiment.groupby('regiment'):
    print(regiment)
    print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70